USE [domofon8]
GO

INSERT INTO [dbo].[del_оплаты]
           ([оплата10]
           ,[номер]
           ,[клиент10]
           ,[сотрудник10]
           ,[удалена]
           ,[дата])
     select оплата
           ,номер
           ,клиент
           ,сотрудник
           ,удалена
           ,дата
		   from domofon.dbo.del_оплата
GO
print 'del_оплаты'
go

INSERT INTO [dbo].[del_оплачено]
           ([оплата10]
           ,[месяц]
           ,[год]
           ,[сумма]
           ,[услуга10]
           ,[дата])
     select
           оплата
           ,месяц
           ,год
           ,сумма
           ,услуга
           ,дата
         from domofon.dbo.del_оплачено
GO
print 'del_оплачено'
go

INSERT INTO [dbo].[виды_услуг]
           ([вид_услуги10]
           ,[наимен]
           ,[порядок])
    select 
           вид_услуги
           ,наимен
           ,порядок
		   from domofon.dbo.вид_услуги
GO
print 'виды_услуг'
go

INSERT INTO [dbo].[возврат]
           ([оплата10]
           ,[месяц]
           ,[год]
           ,[сумма]
           ,[услуга10]
           )
     select
           оплата
           ,месяц
           ,год
		   ,сумма
           ,услуга
		   from domofon.dbo.возврат
GO
print 'возврат'
go

INSERT INTO [dbo].[дома]
           ([дом10]
           ,[наимен]
           ,[порядок]
           ,[улица10]
           ,[номер]
           ,[корпус]
           ,[изменен])
     select
           дом
           ,наимен
           ,порядок
           ,улица
           ,номер
           ,корпус
           ,изменен
		   from domofon.dbo.дом
GO
print 'дома'
go

INSERT INTO [dbo].[звонки]
           (
           [звонок10]
           ,[клиент10]
           ,[дата])
     select
           звонок
           ,клиент
           ,дата
		   from domofon.dbo.звонки
GO
print 'звонки'
go

INSERT INTO [dbo].[клиенты]
           ([клиент10]
           ,[фамилия]
           ,[имя]
           ,[отчество]
           ,[дом10]
           ,[квартира]
           ,[прим]
           ,[подъезд]
           ,[телефон]
           ,[ввод])
     select
           клиент
           ,фамилия
           ,имя
           ,отчество
           ,дом
           ,квартира
           ,прим
           ,подъезд
           ,телефон
           ,ввод
		   from domofon.dbo.клиент
GO
print 'клиенты'
go

INSERT INTO [dbo].[льготы]
           ([льгота10]
           ,[клиент10]
           ,[дата_с]
           ,[дата_по]
           ,[услуга10]
           ,[процент])
     select
           льгота
           ,клиент
           ,дата_с
           ,дата_по
           ,услуга
           ,процент
		   from domofon.dbo.льгота
GO
print 'льготы'
go

INSERT INTO [dbo].[начало]
           ([начало])
    select   начало from domofon.dbo.начало
GO
print 'начало'
go

INSERT INTO [dbo].[опл_работы]
           ([оплата10]
           ,[работа10]
           ,[стоимость]
           ,[оплачено]
           ,[мастер10]
           ,[ст_материалов]
           ,[задание10])
     select
           оплата
           ,работа
           ,стоимость
           ,оплачено
           ,мастер
           ,ст_материалов
           ,задание
		   from domofon.dbo.опл_работы
GO
print 'опл_работы'
go

INSERT INTO [dbo].[оплаты]
           ([оплата10]
           ,[номер]
           ,[клиент10]
           ,[дата]
           ,[сотрудник10])
     select
           оплата
           ,номер
           ,клиент
           ,дата
           ,сотрудник
        from domofon.dbo.оплата
GO
print 'оплаты'
go

INSERT INTO [dbo].[оплачено]
           ([оплата10]
           ,[месяц]
           ,[год]
           ,[сумма]
           ,[услуга10]
           ,[дней]
           ,[длина_мес]
           ,[цена])
     select
           оплата
           ,месяц
           ,год
           ,сумма
           ,услуга
           ,дней
           ,длина_мес
           ,цена
		   from domofon.dbo.оплачено
GO
print 'jgkfxtyj'
go

INSERT INTO [dbo].[отключения]
           ([отключение10]
           ,[клиент10]
           ,[услуга10]
           ,[дата_с]
           ,[дата_по]
           ,[прим]
           ,[мастер10])
     select
           отключение
           ,клиент
           ,услуга
		   ,дата_с
           ,дата_по
           ,прим
           ,мастер
            from domofon.dbo.отключение
GO
print 'отключения'
go

INSERT INTO [dbo].[повторы]
           ([подключение10]
           ,[клиент10]
           ,[услуга10]
           ,[дата_с]
           ,[прим]
           ,[мастер10])
     select
           подключение
           ,клиент
           ,услуга
           ,дата_с
           ,прим
           ,мастер
		   from domofon.dbo.повтор
GO
print 'повторы'
go

INSERT INTO [dbo].[подключения]
           ([код10]
           ,[клиент10]
           ,[дата_с]
           ,[дата_по]
           ,[услуга10]
           ,[номер_дог]
           ,[дата_дог]
           ,[номер_пп]
           ,[мастер10])
     select
           код
           ,клиент
           ,дата_с
           ,дата_по
           ,услуга
           ,номер_дог
           ,дата_дог
           ,номер_пп
           ,мастер
		   from domofon.dbo.подключения
GO
print 'подключения'
go
INSERT INTO [dbo].[поселки]
           ([поселок10]
           ,[наимен]
           ,[порядок])
     select
           поселок
           ,наимен
           ,порядок
		   from domofon.dbo.поселок
GO
print 'поселки'
go

INSERT INTO [dbo].[предупреждения]
           ([предупреждение10]
           ,[дата]
           ,[услуга10]
           ,[клиент10])
     select
           предупреждение
           ,дата
           ,услуга
           ,клиент
            from domofon.dbo.предупреждение
GO
print 'предупреждения'
go
INSERT INTO [dbo].[примечания]
           ([услуга10]
           ,[клиент10]
           ,[прим])
     select
           услуга
           ,клиент
           ,прим
		   from domofon.dbo.примечания
GO
print 'примечания'
go

INSERT INTO [dbo].[простои]
           ([простой10]
           ,[наимен]
           ,[клиент10]
           ,[дата_с]
           ,[дата_по]
           ,[услуга10])
     select
           простой
           ,наимен
           ,клиент
           ,дата_с
           ,дата_по
           ,услуга
		   from domofon.dbo.простой
GO
print 'простои'
go

INSERT INTO [dbo].[раб_дней]
           ([клиент10]
           ,[услуга10]
           ,[год]
           ,[месяц]
           ,[дней]
           ,[прим])
     select
           клиент
           ,услуга
           ,год
           ,месяц
           ,дней
           ,прим
		   from domofon.dbo.раб_дней
GO
print 'раб_дней'
go

INSERT INTO [dbo].[работы]
           ([работа10]
           ,[наимен]
           ,[порядок]
           ,[стоимость]
           ,[ст_материалов]
           ,[прейскурант])
     select
           работа
           ,наимен
           ,порядок
           ,стоимость
           ,ст_материалов
		   ,прейскурант
		   from domofon.dbo.работа
GO
print 'работы'
go
INSERT INTO [dbo].[сотрудники]
           ([сотрудник10]
           ,[фамилия]
           ,[имя]
           ,[отчество]
           ,[порядок]
           ,[прим]
           ,[адрес]
           ,[телефон]
           ,[фото]
           ,[дата_рож]
           ,[принят]
           ,[уволен]
           ,[должность]
           ,[кассир])
     select
           сотрудник
           ,фамилия
           ,имя
           ,отчество
           ,порядок
           ,прим
           ,адрес
           ,телефон
           ,фото
           ,дата_рож
           ,принят
           ,уволен
           ,должность
           ,кассир
		   from domofon.dbo.сотрудник
GO
print 'сотрудники'
go
INSERT INTO [dbo].[улицы]
           ([улица10]
           ,[наимен]
           ,[порядок]
           ,[поселок10])
     select
           улица
           ,наимен
           ,порядок
           ,поселок
           from domofon.dbo.улица
GO
print 'улицы'
go

INSERT INTO [dbo].[услуги]
           ([услуга10]
           ,[наимен]
           ,[порядок]
           ,[вид_услуги10]
           ,[обозначение])
     select
           услуга
           ,наимен
           ,порядок
           ,вид_услуги
           ,обозначение
		   from domofon.dbo.услуга
GO
print 'услуги'
go

INSERT INTO [dbo].[услуги_клиента]
           ([клиент10]
           ,[услуга10])
     select 
           клиент
           ,услуга
      from domofon.dbo.услуги_клиента
GO
print 'услуги_клиента'
go
INSERT INTO [dbo].[филиалы]
           ([филиал10]
           ,[наимен]
           ,[адрес]
           ,[порядок]
           ,[телефон])
     select
           филиал
           ,наимен
           ,адрес
           ,порядок
           ,телефон
		   from domofon.dbo.филиал
GO
print 'филиалы'
go

INSERT INTO [dbo].[фирмы]
           ([фирма10]
           ,[наимен]
           ,[порядок]
           ,[название]
           ,[адрес]
           ,[факт_адрес]
           ,[телефон]
           ,[р_счет]
           ,[к_счет]
           ,[банк]
           ,[город]
           ,[бик]
           ,[код]
           ,[инн]
           ,[окпо]
           ,[оконх]
           ,[груз_пол])
     select
           фирма
           ,наимен
           ,порядок
           ,название
           ,адрес
           ,факт_адрес
           ,телефон
           ,р_счет
           ,к_счет
           ,банк
           ,город
           ,бик
           ,код
           ,инн
           ,окпо
           ,оконх
           ,груз_пол
		   from domofon.dbo.фирма

GO
print 'фирмы'
go

INSERT INTO [dbo].[цены]
           ([год]
           ,[месяц]
           ,[стоимость]
           ,[услуга10])
     select
           год
           ,месяц
           ,стоимость
           ,услуга
		   from domofon.dbo.цены
GO
print 'цены'
go

INSERT INTO [dbo].[шаблоны]
           ([наимен]
           ,[путь])
     select
           наимен
           ,путь
		   from domofon.dbo.шаблоны
GO

print 'шаблоны'
go