USE [domofon14]
GO

INSERT INTO [dbo].[del_оплаты]
           ([оплата]
           ,[номер]
           ,[клиент]
           ,[сотрудник]
           ,[удалена]
           ,[дата])
     select оплата
           ,номер
           ,клиент
           ,сотрудник
           ,удалена
           ,дата
		   from domofon8.dbo.del_оплаты
GO
INSERT INTO [dbo].[del_оплачено]
           ([оплата]
           ,[месяц]
           ,[год]
           ,[сумма]
           ,[услуга]
           ,[дата])
     select
           оплата
           ,месяц
           ,год
           ,сумма
           ,услуга
           ,дата
         from domofon8.dbo.del_оплачено
GO

INSERT INTO [dbo].[виды_услуг]
           ([вид_услуги]
           ,[наимен]
           ,[порядок])
    select 
           вид_услуги
           ,наимен
           ,порядок
		   from domofon8.dbo.виды_услуг
GO

INSERT INTO [dbo].[возврат]
           ([оплата]
           ,[месяц]
           ,[год]
           ,[сумма]
           ,[услуга]
           )
     select
           оплата
           ,месяц
           ,год
		   ,сумма
           ,услуга
		   from domofon8.dbo.возврат
GO

INSERT INTO [dbo].[дома]
           ([дом]
           ,[улица]
           ,[номер]
           ,[корпус]
           ,[изменен])
     select
           дом
           ,улица
           ,номер
           ,корпус
           ,изменен
		   from domofon8.dbo.дома
GO

INSERT INTO [dbo].[звонки]
           (
           [звонок]
           ,[клиент]
           ,[дата]
		   )
     select
           звонок
           ,клиент
           ,дата
		   from domofon8.dbo.звонки
GO

INSERT INTO [dbo].[клиенты]
           ([клиент]
           ,[фамилия]
           ,[имя]
           ,[отчество]
           ,[дом]
           ,[квартира]
           ,[прим]
           ,[подъезд]
           ,[телефон]
           ,[ввод])
     select
           клиент
           ,фамилия
           ,имя
           ,отчество
           ,дом
           ,квартира
           ,прим
           ,подъезд
           ,телефон
           ,ввод
		   from domofon8.dbo.клиенты
GO

INSERT INTO [dbo].[льготы]
           ([льгота]
           ,[клиент]
           ,[дата_с]
           ,[дата_по]
           ,[услуга]
           )
     select
           льгота
           ,клиент
           ,дата_с
           ,дата_по
           ,услуга
		   from domofon8.dbo.льготы
GO

INSERT INTO [dbo].[начало]
           ([дата])
    select   начало from domofon.dbo.начало
GO

INSERT INTO [dbo].[опл_работы]
           ([оплата]
           ,[работа]
           ,[стоимость]
           ,[мастер]
           ,[ст_материалов]
           ,[задание]
		   , номер)
     select
           оплата
           ,работа
           ,стоимость
           ,мастер
           ,ст_материалов
           ,задание
		   , номер
		   from domofon8.dbo.опл_работы
GO

INSERT INTO [dbo].[оплаты]
           ([оплата]
           ,[номер]
           ,[клиент]
           ,[дата]
           ,[сотрудник])
     select
           оплата
           ,номер
           ,клиент
           ,дата
           ,сотрудник
        from domofon8.dbo.оплаты
GO

INSERT INTO [dbo].[оплачено]
           ([оплата]
           ,[месяц]
           ,[год]
           ,[сумма]
           ,[услуга]
           ,[дней]
           ,[длина_мес]
           ,[цена])
     select
           оплата
           ,месяц
           ,год
           ,сумма
           ,услуга
           ,дней
           ,длина_мес
           ,цена
		   from domofon8.dbo.оплачено
GO

INSERT INTO [dbo].[отключения]
           ([отключение]
           ,[клиент]
           ,[услуга]
           ,[дата_с]
           ,[дата_по]
           ,[прим]
           ,[мастер])
     select
           отключение
           ,клиент
           ,услуга
		   ,дата_с
           ,дата_по
           ,прим
           ,мастер
            from domofon8.dbo.отключения
GO

INSERT INTO [dbo].[повторы]
           ([подключение]
           ,[клиент]
           ,[услуга]
           ,[дата_с]
           ,[прим]
           ,[мастер])
     select
           подключение
           ,клиент
           ,услуга
           ,дата_с
           ,прим
           ,мастер
		   from domofon8.dbo.повторы
GO

INSERT INTO [dbo].[подключения]
           ([подключение]
           ,[клиент]
           ,[дата_с]
           ,[дата_по]
           ,[услуга]
           ,[номер_дог]
           ,[дата_дог]
           ,[номер_пп]
           ,[мастер])
     select
           подключение
           ,клиент
           ,дата_с
           ,дата_по
           ,услуга
           ,номер_дог
           ,дата_дог
           ,номер_пп
           ,мастер
		   from domofon8.dbo.подключения
GO

INSERT INTO [dbo].[поселки]
           ([поселок]
           ,[наимен]
           ,[порядок])
     select
           поселок
           ,наимен
           ,порядок
		   from domofon8.dbo.поселки
GO

INSERT INTO [dbo].[предупреждения]
           ([предупреждение]
           ,[дата]
           ,[услуга]
           ,[клиент])
     select
           предупреждение
           ,дата
           ,услуга
           ,клиент
            from domofon8.dbo.предупреждения
GO

INSERT INTO [dbo].[примечания]
           ([услуга]
           ,[клиент]
           ,[прим])
     select
           услуга
           ,клиент
           ,прим
		   from domofon8.dbo.примечания
GO

INSERT INTO [dbo].[простои]
           ([простой]
           ,[наимен]
           ,[клиент]
           ,[дата_с]
           ,[дата_по]
           ,[услуга])
     select
           простой
           ,наимен
           ,клиент
           ,дата_с
           ,дата_по
           ,услуга
		   from domofon8.dbo.простои
GO

INSERT INTO [dbo].[раб_дней]
           ([клиент]
           ,[услуга]
           ,[год]
           ,[месяц]
           ,[дней]
           ,[прим])
     select
           клиент
           ,услуга
           ,год
           ,месяц
           ,дней
           ,прим
		   from domofon8.dbo.раб_дней
GO

INSERT INTO [dbo].[работы]
           ([работа]
           ,[наимен]
           ,[порядок]
           ,[стоимость]
           ,[ст_материалов]
           ,[прейскурант])
     select
           работа
           ,наимен
           ,порядок
           ,стоимость
           ,ст_материалов
		   ,прейскурант
		   from domofon8.dbo.работы
GO

INSERT INTO [dbo].[сотрудники]
           ([сотрудник]
           ,[фамилия]
           ,[имя]
           ,[отчество]
           ,[порядок]
           ,[прим]
           ,[адрес]
           ,[телефон]
           ,[фото]
           ,[дата_рож]
           ,[принят]
           ,[уволен]
           ,[должность]
           ,[кассир])
     select
           сотрудник
           ,фамилия
           ,имя
           ,отчество
           ,порядок
           ,прим
           ,адрес
           ,телефон
           ,фото
           ,дата_рож
           ,принят
           ,уволен
           ,должность
           ,кассир
		   from domofon8.dbo.сотрудники
GO

INSERT INTO [dbo].[улицы]
           ([улица]
           ,[наимен]
           ,[поселок])
     select
           улица
           ,наимен
           ,поселок
           from domofon8.dbo.улицы
GO

INSERT INTO [dbo].[услуги]
           ([услуга]
           ,[наимен]
           ,[порядок]
           ,[вид_услуги]
           ,[обозначение])
     select
           услуга
           ,наимен
           ,порядок
           ,вид_услуги
           ,обозначение
		   from domofon8.dbo.услуги
GO


INSERT INTO [dbo].[услуги_клиента]
           ([клиент]
           ,[услуга])
     select 
           клиент
           ,услуга
      from domofon8.dbo.услуги_клиента
GO

INSERT INTO [dbo].[филиалы]
           ([филиал]
           ,[наимен]
           ,[адрес]
           ,[порядок]
           ,[телефон])
     select
           филиал
           ,наимен
           ,адрес
           ,порядок
           ,телефон
		   from domofon8.dbo.филиалы
GO

INSERT INTO [dbo].[фирмы]
           ([фирма]
           ,[наимен]
           ,[порядок]
           ,[название]
           ,[адрес]
           ,[факт_адрес]
           ,[телефон]
           ,[р_счет]
           ,[к_счет]
           ,[банк]
           ,[город]
           ,[бик]
           ,[код]
           ,[инн]
           ,[окпо]
           ,[оконх]
           ,[груз_пол])
     select
           фирма
           ,наимен
           ,порядок
           ,название
           ,адрес
           ,факт_адрес
           ,телефон
           ,р_счет
           ,к_счет
           ,банк
           ,город
           ,бик
           ,код
           ,инн
           ,окпо
           ,оконх
           ,груз_пол
		   from domofon8.dbo.фирмы

GO

INSERT INTO [dbo].[цены]
           ([год]
           ,[месяц]
           ,[стоимость]
           ,[услуга])
     select
           год
           ,месяц
           ,стоимость
           ,услуга
		   from domofon8.dbo.цены
GO

INSERT INTO [dbo].[шаблоны]
           ([наимен]
           ,[путь])
     select
           наимен
           ,путь
		   from domofon8.dbo.шаблоны
GO

